app/controllers/cidadaos_controller.rb

  def index
    @cidadao = Cidadao.new
    if params[:query].present?
      @cidadaos = Cidadao.buscar_por_dados_ou_endereco(params[:query]).page params[:page]
---
SELECT "cidadaos".* FROM "cidadaos" ORDER BY nome LIMIT $1 OFFSET $2  [["LIMIT", 20], ["OFFSET", 0]]
SELECT COUNT(*) FROM "cidadaos"
SELECT "enderecos".* FROM "enderecos" WHERE "enderecos"."cidadao_id" = $1 LIMIT $2  [["cidadao_id", 1], ["LIMIT", 1]]

  def create
    @cidadao = Cidadao.new(cidadao_params)
    # account_sid = ENV['account_sid']
    # auth_token = ENV['auth_token']
    # @client = Twilio::REST::Client.new(account_sid, auth_token)
    if @cidadao.save
---
INSERT INTO "cidadaos" ("nome", "sobrenome", "cpf", "cns", "email", "data_nascimento", "telefone", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def set_cidadao
    @cidadao = Cidadao.find(params[:id])
---
SELECT "cidadaos".* FROM "cidadaos" WHERE "cidadaos"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]